#### Terraform Format, Workspace and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ekipDevops/CarRental-prod/runs/run-VfX8qNGEiv1DZFuX

Waiting for the plan to start...

Terraform v1.3.8
on linux_amd64
Initializing plugins and modules...
data.aws_availability_zones.available: Reading...
aws_vpc.vpc: Refreshing state... [id=vpc-0306d030cad918b6c]
data.aws_availability_zones.available: Read complete after 1s [id=eu-west-1]
aws_security_group.allow_nat: Refreshing state... [id=sg-0539683f4b23190ca]
aws_internet_gateway.igw: Refreshing state... [id=igw-0ec550e085aa50664]
aws_subnet.public_subnet[2]: Refreshing state... [id=subnet-03e61721c9bd79dcf]
aws_subnet.private_subnet[2]: Refreshing state... [id=subnet-03a0ff2b1f87d49ce]
aws_subnet.public_subnet[0]: Refreshing state... [id=subnet-037a0bd26f58d2d4b]
aws_subnet.public_subnet[1]: Refreshing state... [id=subnet-0fd02eb9256c25bec]
aws_subnet.private_subnet[0]: Refreshing state... [id=subnet-0b557aa3149daa8da]
aws_subnet.private_subnet[1]: Refreshing state... [id=subnet-0ed21e78fe13a4c19]
aws_route_table.public: Refreshing state... [id=rtb-0d1fb66a2a0778267]
aws_security_group_rule.egress_nat: Refreshing state... [id=sgrule-1169548313]
aws_instance.nat: Refreshing state... [id=i-0329a69dc9ed77133]
aws_security_group_rule.allow_nat[2]: Refreshing state... [id=sgrule-1160992311]
aws_security_group_rule.allow_nat[0]: Refreshing state... [id=sgrule-3534505758]
aws_security_group_rule.allow_nat[1]: Refreshing state... [id=sgrule-1960529066]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-07a473e6b632e7b16]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0fa4e6f54a28d8161]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0097237e224088f77]
aws_default_route_table.main-private: Refreshing state... [id=rtb-029d074b8360d4bdd]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e0be6a7109da62ce]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-01c1442cdf92892d4]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-06044b302340613c2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_default_route_table.main-private will be updated in-place
  ~ resource "aws_default_route_table" "main-private" {
        id                     = "rtb-029d074b8360d4bdd"
      ~ route                  = [
          - {
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = "i-0329a69dc9ed77133"
              - ipv6_cidr_block            = ""
              - nat_gateway_id             = ""
              - network_interface_id       = "eni-027a38bd5c0d73e84"
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
            # (1 unchanged element hidden)
        ]
        tags                   = {
            "Name"    = "CarRental-prod-RT-Private"
            "Project" = "CarPlatform"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_ecr_repository_policy.carPlatform-repo-policy will be created
  + resource "aws_ecr_repository_policy" "carPlatform-repo-policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:DescribeRepositories",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:ListImages",
                          + "ecr:DeleteRepository",
                          + "ecr:BatchDeleteImage",
                          + "ecr:SetRepositoryPolicy",
                          + "ecr:DeleteRepositoryPolicy",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Sid       = "adds full ecr access to the car_platform_repository"
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "car_platform_repository"
    }

  # aws_ecs_cluster.car_platform_cluster will be created
  + resource "aws_ecs_cluster" "car_platform_cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "carPlatformApp-CarRental-prod"
      + tags               = {
          + "Name"    = "CarRental-prod-EC"
          + "Project" = "CarPlatform"
        }
      + tags_all           = {
          + "Name"    = "CarRental-prod-EC"
          + "Project" = "CarPlatform"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.car_platform_service will be created
  + resource "aws_ecs_service" "car_platform_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 3
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "carPlatformApp-CarRental-prod"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name"    = "CarRental-prod-ES"
          + "Project" = "CarPlatform"
        }
      + tags_all                           = {
          + "Name"    = "CarRental-prod-ES"
          + "Project" = "CarPlatform"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "CarRental-prod-api"
          + container_port   = 4000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-03a0ff2b1f87d49ce",
              + "subnet-0b557aa3149daa8da",
              + "subnet-0ed21e78fe13a4c19",
            ]
        }
    }

  # aws_ecs_task_definition.car_api_task will be created
  + resource "aws_ecs_task_definition" "car_api_task" {
      + arn                      = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::560022977783:role/ecsTaskExecutionRole"
      + family                   = "carPlatformApp-CarRental-prod"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name"    = "CarRental-prod-TD"
          + "Project" = "CarPlatform"
        }
      + tags_all                 = {
          + "Name"    = "CarRental-prod-TD"
          + "Project" = "CarPlatform"
        }

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # aws_instance.nat must be replaced
-/+ resource "aws_instance" "nat" {
      ~ arn                                  = "arn:aws:ec2:eu-west-1:560022977783:instance/i-0329a69dc9ed77133" -> (known after apply)
      ~ associate_public_ip_address          = false -> true # forces replacement
      ~ availability_zone                    = "eu-west-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0329a69dc9ed77133" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-027a38bd5c0d73e84" -> (known after apply)
      ~ private_dns                          = "ip-10-0-10-122.eu-west-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.10.122" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Name"    = "CarRental-prod-NAT"
            "Project" = "CarPlatform"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0539683f4b23190ca",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-01066de9f036d5868" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_lb.car_platform_alb will be created
  + resource "aws_lb" "car_platform_alb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = "ipv4"
      + load_balancer_type         = "application"
      + name                       = "CarRental-prod-ALB"
      + preserve_host_header       = false
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-037a0bd26f58d2d4b",
          + "subnet-03e61721c9bd79dcf",
          + "subnet-0fd02eb9256c25bec",
        ]
      + tags                       = {
          + "Name"    = "CarRental-prod-ALB"
          + "Project" = "CarPlatform"
        }
      + tags_all                   = {
          + "Name"    = "CarRental-prod-ALB"
          + "Project" = "CarPlatform"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.car_platform_listener will be created
  + resource "aws_lb_listener" "car_platform_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 4000
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "Name"    = "CarRental-prod-ALB-LISTENER"
          + "Project" = "CarPlatform"
        }
      + tags_all          = {
          + "Name"    = "CarRental-prod-ALB-LISTENER"
          + "Project" = "CarPlatform"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.car_platform_target_group will be created
  + resource "aws_lb_target_group" "car_platform_target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "CarRental-prod-TG"
      + port                               = 4000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"    = "CarRental-prod-TG"
          + "Project" = "CarPlatform"
        }
      + tags_all                           = {
          + "Name"    = "CarRental-prod-TG"
          + "Project" = "CarPlatform"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0306d030cad918b6c"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/api/healthcheck"
          + port                = "4000"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # aws_security_group.allow_nat must be replaced
-/+ resource "aws_security_group" "allow_nat" {
      ~ arn                    = "arn:aws:ec2:eu-west-1:560022977783:security-group/sg-0539683f4b23190ca" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-0539683f4b23190ca" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.22.0/24",
                  - "10.0.21.0/24",
                  - "10.0.20.0/24",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ name                   = "allow_web" -> "allow_web-CarRental-prod" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "560022977783" -> (known after apply)
      ~ tags                   = {
          + "Name"    = "CarRental-prod-NAT-SG"
          + "Project" = "CarPlatform"
        }
      ~ tags_all               = {
          + "Name"    = "CarRental-prod-NAT-SG"
          + "Project" = "CarPlatform"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_security_group.fargate_service_sg will be created
  + resource "aws_security_group" "fargate_service_sg" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic on port 4000"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.10.0/24",
                  + "10.0.11.0/24",
                  + "10.0.12.0/24",
                ]
              + description      = ""
              + from_port        = 4000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 4000
            },
        ]
      + name                   = "fargate_service_sg-CarRental-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "CarRental-prod-SG-FARGATE-SERVICE"
          + "Project" = "CarPlatform"
        }
      + tags_all               = {
          + "Name"    = "CarRental-prod-SG-FARGATE-SERVICE"
          + "Project" = "CarPlatform"
        }
      + vpc_id                 = "vpc-0306d030cad918b6c"
    }

  # aws_security_group.http_sg_alb will be created
  + resource "aws_security_group" "http_sg_alb" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic on port 4000"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.20.0/24",
                  + "10.0.21.0/24",
                  + "10.0.22.0/24",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 4000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 4000
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "CarRental-prod-SG-HTTP-ALB-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "CarRental-prod-SG-HTTP-ALB"
          + "Project" = "CarPlatform"
        }
      + tags_all               = {
          + "Name"    = "CarRental-prod-SG-HTTP-ALB"
          + "Project" = "CarPlatform"
        }
      + vpc_id                 = "vpc-0306d030cad918b6c"
    }

  # aws_security_group_rule.allow_nat[0] must be replaced
-/+ resource "aws_security_group_rule" "allow_nat" {
      ~ id                       = "sgrule-3534505758" -> (known after apply)
      ~ security_group_id        = "sg-0539683f4b23190ca" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0c325cd8c321b6cef" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_security_group_rule.allow_nat[1] must be replaced
-/+ resource "aws_security_group_rule" "allow_nat" {
      ~ id                       = "sgrule-1960529066" -> (known after apply)
      ~ security_group_id        = "sg-0539683f4b23190ca" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-00fada2b6022af0ec" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_security_group_rule.allow_nat[2] must be replaced
-/+ resource "aws_security_group_rule" "allow_nat" {
      ~ id                       = "sgrule-1160992311" -> (known after apply)
      ~ security_group_id        = "sg-0539683f4b23190ca" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-058da84e21ab0ba39" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_security_group_rule.egress_nat must be replaced
-/+ resource "aws_security_group_rule" "egress_nat" {
      ~ id                       = "sgrule-1169548313" -> (known after apply)
      ~ security_group_id        = "sg-0539683f4b23190ca" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0c48cefacc5aa2b80" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 15 to add, 1 to change, 6 to destroy.


```

</details>

*Pushed by: @T-jegou, Action: `pull_request`*